uuuulala/TSIC_sensor_with_EFM32ZG-STK3200/emlib/em_pcnt.c
	/* Keep current control setting, must be restored */
	ctrl = pcnt->CTRL;

	/* If enabled, disable pulse counter before changing values */
	if ((ctrl & _PCNT_CTRL_MODE_MASK) != PCNT_CTRL_MODE_DISABLE) {
		PCNT_Sync(pcnt, PCNT_SYNCBUSY_CTRL);
		pcnt->CTRL = (ctrl & ~_PCNT_CTRL_MODE_MASK) | PCNT_CTRL_MODE_DISABLE;
	}

	/* Load into TOPB */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_TOPB);
	pcnt->TOPB = count;

	/* Load TOPB value into TOP */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_TOPB | PCNT_SYNCBUSY_CMD);

	/* This bit has no effect on rev. C and onwards parts - for compatibility */
	pcnt->CMD = PCNT_CMD_LTOPBIM;
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_CMD);

	/* Load TOP into CNT */
	pcnt->CMD = PCNT_CMD_LCNTIM;

	/* Restore TOP? ('count' setting has been loaded into pcnt->TOP, better
	 * to use 'top' than pcnt->TOP in compare, since latter may in theory not
	 * be visible yet.) */
	if (top != count) {
		/* Wait for command to sync LCNTIM before setting TOPB */
		PCNT_Sync(pcnt, PCNT_SYNCBUSY_CMD);

		/* Load into TOPB, we don't need to check for TOPB sync complete here,
		 * it has been ensured above. */
		pcnt->TOPB = top;

		/* Load TOPB value into TOP */
		PCNT_Sync(pcnt, PCNT_SYNCBUSY_TOPB | PCNT_SYNCBUSY_CMD);
		pcnt->CMD = PCNT_CMD_LTOPBIM;
	}

	/* Reenable if it was enabled */
	if ((ctrl & _PCNT_CTRL_MODE_MASK) != PCNT_CTRL_MODE_DISABLE) {
		PCNT_Sync(pcnt, PCNT_SYNCBUSY_CTRL | PCNT_SYNCBUSY_CMD);
		pcnt->CTRL = ctrl;
	}
}

/***************************************************************************//**
 * @brief
 *   Set PCNT operational mode.
 *
 * @details
 *   Notice that this function does not do any configuration. Setting operational
 *   mode is normally only required after initialization is done, and if not
 *   done as part of initialization. Or if requiring to disable/reenable pulse
 *   counter.
 *
 * @note
 *   This function may stall until synchronization to low frequency domain is
 *   completed. For that reason, it should normally not be used when using
 *   an external clock to clock the PCNT module, since stall time may be
 *   undefined in that case.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] mode
 *   Operational mode to use for PCNT.
 ******************************************************************************/
void PCNT_Enable(PCNT_TypeDef *pcnt, PCNT_Mode_TypeDef mode) {
	uint32_t tmp;

	EFM_ASSERT(PCNT_REF_VALID(pcnt));

	/* Set as specified */
	tmp = pcnt->CTRL & ~_PCNT_CTRL_MODE_MASK;
	tmp |= (uint32_t) mode << _PCNT_CTRL_MODE_SHIFT;

	/* LF register about to be modified require sync. busy check */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_CTRL);
	pcnt->CTRL = tmp;
}

#if defined(_PCNT_INPUT_MASK)
/***************************************************************************//**
 * @brief
 *   Enable/disable the selected PRS input of PCNT.
 *
 * @details
 *   Notice that this function does not do any configuration.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] prsInput
 *   PRS input (S0 or S1) of the selected PCNT module.
 *
 * @param[in] enable
 *   Set to true to enable, false to disable the selected PRS input.
 ******************************************************************************/
void PCNT_PRSInputEnable(PCNT_TypeDef *pcnt, PCNT_PRSInput_TypeDef prsInput,
bool enable) {
	EFM_ASSERT(PCNT_REF_VALID(pcnt));

	/* Enable/disable the selected PRS input on the selected PCNT module. */
	switch (prsInput) {
	/* Enable/disable PRS input S0. */
	case pcntPRSInputS0:
		BUS_RegBitWrite(&(pcnt->INPUT), _PCNT_INPUT_S0PRSEN_SHIFT, enable);
		break;

		/* Enable/disable PRS input S1. */
	case pcntPRSInputS1:
		BUS_RegBitWrite(&(pcnt->INPUT), _PCNT_INPUT_S1PRSEN_SHIFT, enable);
		break;

		/* Invalid parameter, asserted. */
	default:
		EFM_ASSERT(0);
		break;
	}
}
#endif

/***************************************************************************//**
 * @brief
 *   PCNT register synchronization freeze control.
 *
 * @details
 *   Some PCNT registers require synchronization into the low frequency (LF)
 *   domain. The freeze feature allows for several such registers to be
 *   modified before passing them to the LF domain simultaneously (which
 *   takes place when the freeze mode is disabled).
 *
 * @note
 *   When enabling freeze mode, this function will wait for all current
 *   ongoing PCNT synchronization to LF domain to complete (Normally
 *   synchronization will not be in progress.) However for this reason, when
 *   using freeze mode, modifications of registers requiring LF synchronization
 *   should be done within one freeze enable/disable block to avoid unecessary
 *   stalling.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] enable
 *   @li true - enable freeze, modified registers are not propagated to the
 *       LF domain
 *   @li false - disables freeze, modified registers are propagated to LF
 *       domain
 ******************************************************************************/
void PCNT_FreezeEnable(PCNT_TypeDef *pcnt, bool enable) {
	EFM_ASSERT(PCNT_REF_VALID(pcnt));

	if (enable) {
		/* Wait for any ongoing LF synchronization to complete. This is just to
		 * protect against the rare case when a user:
		 * - modifies a register requiring LF sync
		 * - then enables freeze before LF sync completed
		 * - then modifies the same register again
		 * since modifying a register while it is in sync progress should be
		 * avoided. */
		while (pcnt->SYNCBUSY)
			;

		pcnt->FREEZE = PCNT_FREEZE_REGFREEZE;
	} else {
		pcnt->FREEZE = 0;
	}
}

/***************************************************************************//**
 * @brief
 *   Init pulse counter.
 *
 * @details
 *   This function will configure the pulse counter. The clock selection is
 *   configured as follows, depending on operational mode:
 *
 *   @li #pcntModeOvsSingle - Use LFACLK.
 *   @li #pcntModeExtSingle - Use external PCNTn_S0 pin.
 *   @li #pcntModeExtQuad - Use external PCNTn_S0 pin.
 *
 *   Notice that the LFACLK must be enabled in all modes, since some basic setup
 *   is done with this clock even if external pin clock usage mode is chosen.
 *   The pulse counter clock for the selected instance must also be enabled
 *   prior to init.
 *
 *   Notice that pins used by the PCNT module must be properly configured
 *   by the user explicitly through setting the ROUTE register, in order for
 *   the PCNT to work as intended.
 *
 *   Writing to CNT will not occur in external clock modes (EXTCLKQUAD and
 *   EXTCLKSINGLE) because the external clock rate is unknown. The user should
 *   handle it manually depending on the application
 *
 *   TOPB is written for all modes but in external clock mode it will take
 *   3 external clock cycles to sync to TOP
 *
 *
 * @note
 *   Initializing requires synchronization into the low frequency domain. This
 *   may cause some delay.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] init
 *   Pointer to initialization structure used to initialize.
 ******************************************************************************/
void PCNT_Init(PCNT_TypeDef *pcnt, const PCNT_Init_TypeDef *init) {
	unsigned int inst;
	uint32_t tmp;

	EFM_ASSERT(PCNT_REF_VALID(pcnt));

#ifdef PCNT0
	if (PCNT0 == pcnt) {
		EFM_ASSERT((1<<PCNT0_CNT_SIZE) > init->counter);
		EFM_ASSERT((1<<PCNT0_CNT_SIZE) > init->top);
	}
#endif

#ifdef PCNT1
	if (PCNT1 == pcnt)
	{
		EFM_ASSERT((1<<PCNT1_CNT_SIZE) > init->counter);
		EFM_ASSERT((1<<PCNT1_CNT_SIZE) > init->top);
	}
#endif

#ifdef PCNT2
	if (PCNT2 == pcnt)
	{
		EFM_ASSERT((1<<PCNT2_CNT_SIZE) > init->counter);
		EFM_ASSERT((1<<PCNT2_CNT_SIZE) > init->top);
	}
#endif

	/* Map pointer to instance */
	inst = PCNT_Map(pcnt);

