uuuulala/TSIC_sensor_with_EFM32ZG-STK3200/emlib/em_pcnt.c
	PCNT_TopBufferSet(pcnt, _PCNT_TOPB_RESETVALUE);

	/* Reset CTRL leaving RSTEN set */
	pcnt->CTRL = _PCNT_CTRL_RESETVALUE | PCNT_CTRL_RSTEN;

	/* Disable reset after CTRL reg has been synchronized */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_CTRL);
	BUS_RegBitWrite(&(pcnt->CTRL), _PCNT_CTRL_RSTEN_SHIFT, 0);

	/* Clear pending interrupts */
	pcnt->IFC = _PCNT_IFC_MASK;

	/* Do not reset route register, setting should be done independently */
}

#if defined(PCNT_OVSCFG_FILTLEN_DEFAULT)
/***************************************************************************//**
 * @brief
 *   Set filter configuration.
 *
 * @details
 *   This function will configure the PCNT input filter, when the PCNT mode is
 *   configured to take an LFA-derived clock as input clock.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] config
 *   Pointer to configuration structure to be applied.
 *
 * @param[in] enable
 *   Whether to enable or disable filtering
 ******************************************************************************/
void PCNT_FilterConfiguration(PCNT_TypeDef *pcnt, const PCNT_Filter_TypeDef *config, bool enable) {
	uint32_t ovscfg = 0;

	EFM_ASSERT(PCNT_REF_VALID(pcnt));

	/* Construct new filter setting value */
	ovscfg = ((config->filtLen & _PCNT_OVSCFG_FILTLEN_MASK) << _PCNT_OVSCFG_FILTLEN_SHIFT)
	| ((config->flutterrm & 0x1) << _PCNT_OVSCFG_FLUTTERRM_SHIFT);

	/* Set new configuration. LF register requires sync check before writing. */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_OVSCFG);
	pcnt->OVSCFG = ovscfg;

	/* Set new state of filter. LF register requires sync check before writing. */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_CTRL);
	if(enable)
	{
		pcnt->CTRL |= PCNT_CTRL_FILT;
	}
	else
	{
		pcnt->CTRL &= ~PCNT_CTRL_FILT;
	}
}
#endif

#if defined(PCNT_CTRL_TCCMODE_DEFAULT)
/***************************************************************************//**
 * @brief
 *   Set Triggered Compare and Clear configuration.
 *
 * @details
 *   This function will configure the PCNT TCC (Triggered Compare and Clear)
 *   module. This module can, upon a configurable trigger source, compare the
 *   current counter value with the configured TOP value. Upon match, the counter
 *   will be reset, and the TCC PRS output and TCC interrupt flag will be set.
 *
 *   Since there is a comparison with the TOP value, the counter will not stop
 *   counting nor wrap when hitting the TOP value, but it will keep on counting
 *   until its maximum value. Then, it will not wrap, but instead stop counting
 *   and set the overflow flag.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] config
 *   Pointer to configuration structure to be applied.
 ******************************************************************************/
void PCNT_TCCConfiguration(PCNT_TypeDef *pcnt, const PCNT_TCC_TypeDef *config) {
	uint32_t ctrl = 0;
	uint32_t mask = _PCNT_CTRL_TCCMODE_MASK | _PCNT_CTRL_TCCPRESC_MASK
			| _PCNT_CTRL_TCCCOMP_MASK | _PCNT_CTRL_PRSGATEEN_MASK
			| _PCNT_CTRL_TCCPRSPOL_MASK | _PCNT_CTRL_TCCPRSSEL_MASK;

	EFM_ASSERT(PCNT_REF_VALID(pcnt));

	/* construct TCC part of configuration register */
	ctrl |=
			(config->mode << _PCNT_CTRL_TCCMODE_SHIFT) & _PCNT_CTRL_TCCMODE_MASK;
	ctrl |= (config->prescaler << _PCNT_CTRL_TCCPRESC_SHIFT)
			& _PCNT_CTRL_TCCPRESC_MASK;
	ctrl |= (config->compare << _PCNT_CTRL_TCCCOMP_SHIFT)
			& _PCNT_CTRL_TCCCOMP_MASK;
	ctrl |= (config->tccPRS << _PCNT_CTRL_TCCPRSSEL_SHIFT)
			& _PCNT_CTRL_TCCPRSSEL_MASK;
	ctrl |= (config->prsPolarity << _PCNT_CTRL_TCCPRSPOL_SHIFT)
			& _PCNT_CTRL_TCCPRSPOL_MASK;
	ctrl |= (config->prsGateEnable << _PCNT_CTRL_PRSGATEEN_SHIFT)
			& _PCNT_CTRL_PRSGATEEN_MASK;

	/* Load new TCC config to PCNT. LF register requires sync check before write. */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_CTRL);
	pcnt->CTRL = (pcnt->CTRL & (~mask)) | ctrl;
}
#endif

/***************************************************************************//**
 * @brief
 *   Set top buffer value.
 *
 * @note
 *   This function may stall until synchronization to low frequency domain is
 *   completed. For that reason, it should normally not be used when using
 *   an external clock to clock the PCNT module, since stall time may be
 *   undefined in that case.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] val
 *   Value to set in top buffer register.
 ******************************************************************************/
void PCNT_TopBufferSet(PCNT_TypeDef *pcnt, uint32_t val) {
	EFM_ASSERT(PCNT_REF_VALID(pcnt));

	/* LF register about to be modified require sync. busy check */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_TOPB);
	pcnt->TOPB = val;
}

/***************************************************************************//**
 * @brief
 *   Set top value.
 *
 * @note
 *   This function will stall until synchronization to low frequency domain is
 *   completed. For that reason, it should normally not be used when using
 *   an external clock to clock the PCNT module, since stall time may be
 *   undefined in that case.
 *
 * @param[in] pcnt
 *   Pointer to PCNT peripheral register block.
 *
 * @param[in] val
 *   Value to set in top register.
 ******************************************************************************/
void PCNT_TopSet(PCNT_TypeDef *pcnt, uint32_t val) {
	EFM_ASSERT(PCNT_REF_VALID(pcnt));

#ifdef PCNT0
	if (PCNT0 == pcnt) {
		EFM_ASSERT((1<<PCNT0_CNT_SIZE) > val);
	}
#endif

#ifdef PCNT1
	if (PCNT1 == pcnt)
	{
		EFM_ASSERT((1<<PCNT1_CNT_SIZE) > val);
	}
#endif

#ifdef PCNT2
	if (PCNT2 == pcnt)
	{
		EFM_ASSERT((1<<PCNT2_CNT_SIZE) > val);
	}
#endif

	/* LF register about to be modified require sync. busy check */

	/* Load into TOPB */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_TOPB);
	pcnt->TOPB = val;

	/* Load TOPB value into TOP */
	PCNT_Sync(pcnt, PCNT_SYNCBUSY_TOPB | PCNT_SYNCBUSY_CMD);
	pcnt->CMD = PCNT_CMD_LTOPBIM;
}

/** @} (end addtogroup PCNT) */
/** @} (end addtogroup emlib) */
#endif /* defined(PCNT_COUNT) && (PCNT_COUNT > 0) */
